Revit 2026 API

# LightingFixture Properties

---

The LightingFixture type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. (Inherited from MEPModel) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MEPModel) |

#### Reference

LightingFixture Class

Autodesk.Revit.DB.Electrical Namespace